In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("train.csv")

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
subset=df[["PassengerId","Survived","Pclass","Age","SibSp","Parch"]]

In [7]:
subset.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch
0            1         0       3  22.0      1      0
1            2         1       1  38.0      1      0
2            3         1       3  26.0      0      0
3            4         1       1  35.0      1      0
4            5         0       3  35.0      0      0

In [10]:
#adding family count including the person having passenger id
df["Family"]=df["SibSp"]+df["Parch"]+1

In [11]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [13]:
#number of rows and column
df.shape

(891, 13)

In [15]:
#total size of the dataset
df.size

11583

In [18]:
#brief stats on dataset

df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Family
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,1.904602
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,1.613459
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,1.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,1.000000
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,1.000000
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,2.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,11.000000

In [20]:
#gives column names,number of non missing value rows ,datatype pf each column
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
Family         891 non-null int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [25]:
#gives non missing value=True and missing value=false
df.isnull().head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
0,False,False,False,False,False,False,False,False,False,False,True,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False,False

In [26]:
#number of missing values
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Family           0
dtype: int64

In [29]:
#finds percentage of missing null
df.isnull().sum()/891

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
Family         0.000000
dtype: float64

In [31]:
#median
df["Age"].median()

28.0

In [32]:
#average(mean)
df["Age"].mean()

29.69911764705882

In [33]:
#mode
df["Age"].mode()

0    24.0
dtype: float64

In [35]:
df["Age"]=df["Age"].fillna(value=df["Age"].median())

In [36]:
df["Age"].isnull().sum()

0

In [39]:
#replacing missing value in categorical variable by most frequently occured value
df["Embarked"].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [40]:
df["Embarked"]=df["Embarked"].fillna(value="S")

In [42]:
df["Embarked"].isnull().sum()

0

In [46]:
df.groupby("Pclass").sum()

        PassengerId  Survived       Age  SibSp  Parch        Fare  Family
Pclass
1             99705       136   7951.42     90     77  18177.4125     383
2             82056        87   5476.83     74     70   3801.8417     328
3            215625       119  12732.92    302    193   6714.6951     986

In [47]:
#we can see pclass1 has high survival,they paid more and thier family isless
df.groupby("Pclass").mean()

,PassengerId,Survived,Age,SibSp,Parch,Fare,Family
Pclass,,,,,,,
1,461.597222,0.629630,36.812130,0.416667,0.356481,84.154687,1.773148
2,445.956522,0.472826,29.765380,0.402174,0.380435,20.662183,1.782609
3,439.154786,0.242363,25.932627,0.615071,0.393075,13.675550,2.008147

In [49]:
#female are surviving more
df.groupby("Sex").mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Family
Sex,,,,,,,,
female,431.028662,0.742038,2.159236,27.929936,0.694268,0.649682,44.479818,2.343949
male,454.147314,0.188908,2.389948,30.140676,0.429809,0.235702,25.523893,1.665511